module.exports = {
  config: {
    name: "rules",
    version: "1.0.0",
    author: "MR_FARHAN",
    role: 0,
    shortDescription: "Group Rules",
    category: "group"
  },

  onStart: async function ({ api, event, message }) {
    try {
      const threadInfo = await api.getThreadInfo(event.threadID);
      const groupName = threadInfo?.threadName || "Group";

      const imageUrl = "https://i.imgur.com/zHivkUd.jpeg";

      const rules = `‎╔═════════════════════╗
‎          ⚠️❌ 𝐑𝐔𝐋𝐄𝐒 𝐅𝐎𝐑 ❌⚠️
‎╚═════════════════════╝
‎                           👇👇
‎${groupName}
‎
‎✦────────────────────✦
‎           𝐆𝐫𝐨𝐮𝐩 এ চলার নিয়ম👇👇  
‎✦────────────────────✦
‎
‎══════════════════════
‎➤ ⚠️....গ্রুপ থেকে  কাউকে  inbox করা যাবে না...Friend request দেওয়া যাবে না...📴❌
‎‎══════════════════════
‎➤ ⚠️⚠️18+কথা বা পিক ভিডিও দেওয়া  যাবে না ....📴❌
‎‎══════════════════════
‎➤ ✅প্রতিদিন গ্রুপে  সময় দিতে হবে.....✅🌻
‎‎══════════════════════
‎➤ ⚠️⚠️এক টানা ২ দিন গ্রুপে না আসলে কিক দেওয়া হবে ... আপনি যখন আবার গ্রুপে সময় দিতে পারবেন.... তখন এডমিন কে বলবেন আপনাকে আবার অ্যাড করে দেওয়া হবে✅✅
‎‎══════════════════════
‎➤ ২ বার এর বেশি লিভ নিলে ৩য় বার এড করা হবে না
‎══════════════════════
‎➤ ⚠️⚠️..... Admin text Off রাখতে বললে text off রাখতে হবে..✅
‎‎══════════════════════
‎➤ ও আমাদের বক্সে প্রতিদিন কলে ৩ থেকে ৪ ঘন্টা সময় দিতে হবে  🙏
‎‎══════════════════════
‎➤ ও আমাদের বক্সের এস এস টাইম বাধ্যতামূলক কলে থাকতেই হবে 🙏🙏
‎‎══════════════════════
‎➤ ❌৩ টার বেশি ইমোজি দেওয়া যাবে না ❌
‎‎══════════════════════
‎➤ আমাদের বক্সে থাকতে হলে লোগো মাস্ট লোগো পরতেই হবে✅
‎‎══════════════════════
‎➤ ভিডিও কল বা স্ক্রিন শেয়ার চালু করা সম্পূর্ণ নিষেধ ⚠️⚠️
‎‎══════════════════════
‎➤ গ্ৰুপের ভিতরে কোনো ধরনের গেমের কথা বা লিংক দেওয়া যাবে না বাহিরের কোন এস এস দেওয়া যাবে না 
‎‎══════════════════════
‎➤ গ্ৰুপের পিক বা নাম অথবা থিম চেন্জ করা যাবে না ⚠️⚠️
‎‎══════════════════════
‎➤ গ্ৰুপে প্রেম পিরিতি নট এলাউ ⚠️😓
‎‎══════════════════════
‎➤ কোনো সমস্যা হলে মেম্বারদের কাছে না বলে  admin কে জানাবেন ... ✅✅
‎‎══════════════════════
‎⚠️⚠️..... কোনো কারনে রিমুভ হলে  এডমিন দোষি না.... বিনা কারনে কাউকে রিমুভ করা হবে না🌺 ✅
‎══════════════════════
‎✦────────────────────✦
‎           ∙──༅༎ 𝐂𝐑𝐄𝐀𝐓𝐎𝐑 ༎༅──∙
‎✦────────────────────✦`;

      const stream = await global.utils.getStreamFromURL(imageUrl);

      return message.reply({
        body: rules,
        attachment: [stream]
      });

    } catch (err) {
      console.log("Rules command error:", err);
      return message.reply("❌ Rules command failed to load.");
    }
  }
};
